Exercises/WS_Exercises-master/HamAndEggsApp/test/TestHamAndEggs/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ham="http://hamandeggs.ws">
  <soapenv:Body>
    <ham:hamAndEggsOperation>
      <input>4</input>
    </ham:hamAndEggsOperation>
  </soapenv:Body>
</soapenv:Envelope>